# ------------------------------------------------------------------------


# ------------------------------------------------------------------------


# ------------------------------------------------------------------------
# 1 ~ 1000 범위에서 2의 배수만 저장하는 데이터를 생성
# 그 데이터의 모든 요소를 출력하시오.
# ------------------------------------------------------------------------

nums=list(range(2,1001,2))          # range(시작 숫자, 끝 숫자 +1, 간격)
print(nums)
# 반복문과 조건물 필요없이 원하는 데이터 생성

print('\n')
# ------------------------------------------------------------------------
# if nums[0]%2==0:      ===>        2로 나눈 나머지가 0가 같다면
nums=range(1,1001)
nums=list(nums)
print(nums, len(nums))

nums2=[]
# if nums[0]%2==0: nums2.append(nums[0])

count=0
while count<1000:  # =있으면 안됨.
    print(count)
    if nums[count] % 2 == 0 :
        nums2.append(nums[count])
    count=count+1


print(nums2)




