# 코드가 아니고 설명을 남기고 싶은 경우에 사용
# 주석이라고 함
# --------------------------------------------------
# 메모리에 데이터 저장 실습
# 저장                 문법 =>  변수명 = 데이터
# 메모리에서 데이터 읽기 문법 =>  변수명
# --------------------------------------------------
# 컴퓨터(메모리)에 숫자 저장
age=12
pw=123456
schoolnum=1020
height=172.8

# 컴퓨터(메모리)에 문자열 저장
name='홍길동'
msg="Happy New Year"
comment="""좋은 하루 보내길바래. 
         행복한 크리스마스 되길바래!
         
         ㅇㄹㅇㄹㄹ
         ㅇㄹㅇㄹㅇㄹ
         ㅇㄹㅇㄹㅇㄹ
         ㅇㄹㅇㄹ
         """
com='''
dd
dd
dd
dd
dd
dd
d'''

# 컴퓨터(메모리)에 저장된 데이터 읽어오기
height
name
print(height)
print(comment)
