# 1.컴퓨터 메모리에 데이터를 저장하는 문법을 적으세요.
# 1-1. 영화제목을 컴퓨터 메모리에 저장해 주세요.
movie_title='배트맨'
# 1-2.학번, 전공, 이름, 학년을 컴퓨터 메모리에 저장해 주세요.
school_num='2016115882'
majar='고고인류학과'
name='박병준'
grade=4
# 1-3. 전화번호, 이메일을 컴퓨터 메모리에 저장해 주세요.
phone_num='01052410476'
email='qud0511@naver.com'
# ----------------------------------------------------------------
# 2. 컴퓨터 메모리에 저장된 데이터를 읽어오는 문법을 적으세요.
# 2-1. 컴퓨터 메모리에 저장된 영화제목을 읽어서 화면에 출력해 주세요.
print(movie_title)
# 2-2. 컴퓨터 메모리에 저장된 학번, 이름, 학년을 읽어서 화면에 출력해주세요.
print(school_num)
print(name)
print(grade)
#2-3. 컴퓨터 메모리에 저장된 전화번호, 이메일을 읽어서 화면에 출력해주세요.
print(phone_num)
print(email)
# ----------------------------------------------------------------
# 3. 컴퓨터 메모리에 저장된 영화제목을 가지고 오는 변수에 대한 문제입니다.
# 3-1. 변수에 저장된 값을 가지고 오세요.
movie_title
# 3-2. 변수에 저장된 값을 가지고 와서 화면에 출력해주세요.
print(movie_title)
# 4. 재료를 주면 특정 기능을 수행하는 것을 무엇이라 하나요?
# (답)함수
