# --------------------------------------------------------------------------------------
# 숫자 데이터 자료형
# -정수 => int 타입 (interger)
# -실수 => float 타입 (floating-point)
# --------------------------------------------------------------------------------------
age=26
year=2022
# --------------------------------------------------------------------------------------
# 숫자 데이터 => 계산, 즉 4칙 연산
# 덧셈(+), 뺄셈(-), 곱셈(*), 나눗셈(/), 제곱(**)
# 나누기에서 몫(//), 나머지(%)
# --------------------------------------------------------------------------------------
# 특정 기능을 가진 코드를 묶어서 언제든지 사용할 수 있도록 하는 것 => 함수(Function)
# print(변수명), sum... 이것을 함수명이라고 함.
# 함수호출 => 함수명(데이터 또는 변수)
# --------------------------------------------------------------------------------------
num1=11
num2=22
result=num1+num2
# --------------------------------------------------------------------------------------
# 화면(모니터)에 출력하는 기능 함수 => print 함수
# 사용방법 : print(데이터 또는 변수)
print(1)
print('ABC')
print('Happy Year', 2022, 'HaHaHa')
print(result)
print(result, num1+num2)
print(num1-num2)
print(num1*num2)
print(num1/num2)
print(num1//num2)
print(num1%num2)
print(num1**num2)

