# -------------------------------------------------------
#
# -------------------------------------------------------

# -------------------------------------------------------
# 1~1000범위에서 2의 배수만 저장하는 데이터를 생성
# 그 데이터의 모든 요소를 출력하세요.
# -------------------------------------------------------
# 반복문과 조건문 필요없이 원하는 데이터 생성
nums=list(range(2, 1001,2))
print(nums)

# 반복문과 조건문 실습용 -----------------------------------
nums=list(range(1,10001))
nums2=[]

"""if nums[0]%2==0: nums2.append(nums[0])
if nums[1]%2==0: nums2.append(nums[1])
if nums[2]%2==0: nums2.append(nums[2])
if nums[3]%2==0: nums2.append(nums[3])
if nums[4]%2==0: nums2.append(nums[4])
if nums[5]%2==0: nums2.append(nums[5])"""

count=0
while count<=1000:
    if nums[count] % 2 == 0:
        nums2.append(nums[count])
    count=count+1

print(nums2)


# ------------------------------------------
# 사용자로부터 데이터를 입력 받아서 저장 합니다.
# 몇 개의 데이터를 입력 받을 지는 모릅니다
# 단, 사용자가 'q'를 입력하면 종료해 주세요.
# -----------------------------------------
datas=[]

while True:
    d=input("저장하고 싶은 데이터 입력하세요~ ")

    if d == 'q': break    # 반복 중단하는 조건

    datas.append(d)

# --------------------------------------------------
# 3단 출력
# 3 * 1 = 3
# 3 * 2 = 6
# 3 * 3 = 9
# 3 * 4 = 12
#     :
# 3 * 9 = 27
# --------------------------------------------------
