# -----------------------------------------------------------
# 조건부 표현식 ===> 삼항연산자
# if ~ else 구문을 1라인으로 표현
# 형태 =>  True일때 실행코드 if 조건식 else False일때 실행코드
# -----------------------------------------------------------
jumsu=79

if jumsu>=60:
    print("합격")
else:
    print("불합격")

print("합격") if jumsu>=60 else print("불합격")

# 두 개의 숫자를 입력 받아서 나눗셈하는 프로그램
num1,num2=11,0
print(num1/num2 if num2>0 else f"{num2}로는 나눌 수 없음")

# ------------------------------------------------------------
# 숫자가 양수, 0, 음수 중 어느것인지 출력하기
# 조건부표현식 사용
# if num>0
# elif num<0
# else
# ------------------------------------------------------------
num=12
msg="양수" if num>0 else "음수" if num<0 else "0"
print(f'{num} - {msg}')


